app/controllers/videos_controller.rb

  def show
    @videos = Video.all
---
SELECT  "videos".* FROM "videos" WHERE (id > 1)  ORDER BY "videos"."id" DESC LIMIT 1

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("wistia", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wistia", "Video"], ["description", "Outcome trailer."], ["created_at", "2015-04-24 17:57:17.827812"], ["updated_at", "2015-04-24 17:57:17.827812"]]

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE "videos" SET "wistia" = ?, "updated_at" = ? WHERE "videos"."id" = ?  [["wistia", "gd5gew8em3"], ["updated_at", "2015-04-25 11:05:44.874538"], ["id", 1]]